import vjmap from 'vjmap';
import type MapApp from '~/MapApp';
import { listMapImages } from '../utils';
import basic from './basic';
import common from './data'
import option  from './option';
export default {
    name: '背景图层',
    title: '背景图层',
    collapse: "其他图层",
    matchSource: [''], 
    icon: `M810.666667 128H213.333333c-46.933333 0-85.333333 38.4-85.333333 85.333333v597.333334c0 46.933333 38.4 85.333333 85.333333 85.333333h597.333334c46.933333 0 85.333333-38.4 85.333333-85.333333V213.333333c0-46.933333-38.4-85.333333-85.333333-85.333333zM187.733333 283.733333l96-96c8.533333-8.533333 21.333333-8.533333 29.866667 0l29.866667 29.866667c8.533333 8.533333 8.533333 21.333333 0 29.866667l-96 96c-8.533333 8.533333-21.333333 8.533333-29.866667 0l-29.866667-29.866667c-8.533333-6.4-8.533333-21.333333 0-29.866667z m10.666667 236.8L507.733333 211.2c8.533333-8.533333 21.333333-8.533333 29.866667 0l29.866667 29.866667c8.533333 8.533333 8.533333 21.333333 0 29.866666L258.133333 580.266667c-8.533333 8.533333-21.333333 8.533333-29.866666 0l-29.866667-29.866667c-8.533333-8.533333-8.533333-21.333333 0-29.866667z m40.533333 294.4l-29.866666-29.866666c-8.533333-8.533333-8.533333-21.333333 0-29.866667L753.066667 211.2c8.533333-8.533333 21.333333-8.533333 29.866666 0l29.866667 29.866667c8.533333 8.533333 8.533333 21.333333 0 29.866666L270.933333 814.933333c-8.533333 8.533333-23.466667 8.533333-32 0z m226.133334 17.066667l-29.866667-29.866667c-8.533333-8.533333-8.533333-21.333333 0-29.866666L759.466667 448c8.533333-8.533333 21.333333-8.533333 29.866666 0l29.866667 29.866667c8.533333 8.533333 8.533333 21.333333 0 29.866666L494.933333 832c-8.533333 8.533333-21.333333 8.533333-29.866666 0z m373.333333-102.4l-89.6 89.6c-8.533333 8.533333-21.333333 8.533333-29.866667 0L689.066667 789.333333c-8.533333-8.533333-8.533333-21.333333 0-29.866666l89.6-89.6c8.533333-8.533333 21.333333-8.533333 29.866666 0l29.866667 29.866666c8.533333 6.4 8.533333 21.333333 0 29.866667z`,
    factory: (data: any, form: any, mapApp: MapApp): any => {
        return {
            option: {...option},
            expanded: ["通用设置", "绘制设置"],
            default: {
                backgroundColor: "#572782",
                backgroundOpacity: 0.6
            },
            rule: [
                ...basic(data, form, mapApp),
                ...common(data, form, mapApp, true, true),
                {
                    type: 'exprComp',
                    field: 'backgroundColor',
                    title: '背景色',
                    collapse: "绘制设置",
                    value: data.backgroundColor,
                    props: {
                        childType: "ColorPicker",
                        showAlpha: false,
                        placeholder: '',
                    }
                },
                {
                    type: 'exprComp',
                    field: 'backgroundOpacity',
                    title: '背景透明度',
                    collapse: "绘制设置",
                    value: data.backgroundOpacity,
                    props: {
                        childType: "InputNumber",
                        step: 0.01,
                        min: 0,
                        max: 1,
                        placeholder: '',
                    }
                },
                {
                    type: 'exprComp',
                    field: 'backgroundPattern',
                    title: '背景图案',
                    collapse: "绘制设置",
                    value: data.backgroundPattern,
                    info: '填充图片类型，一定要与地图之前加载的图片名字一一对应,图像宽度必须是2的系数（2、4、8、…、512',
                    props: {
                        childType: "select",
                        placeholder: '', 
                        options: listMapImages(mapApp?.map),
                    }
                },
            ],
            
        }
    }
};